package command

import (
	"LanMei/bot/biz/dao"
	"LanMei/bot/utils/llog"
	"context"
	"fmt"
	"math/rand"
	"time"
)

var sign = [][4]string{{"上签", "开天辟地作良缘　吉日良时万物全　 若得此签非小可　人行忠正帝王宣", "天开地辟。结良缘是天地开创之象。为大吉大利之象也。日吉时良。万事俱全顺遂之命。能蒙神指示为此签之人。非小可也。劝君必行中正帝王亦宣言曰。如能行之正直。积善。修身时。必能持之恒久。如宋太祖。赵匡胤之黄袍加身。急速非速言来时值观音降事报与君之者。", "★★★★★"},
	{"中下签", "鲸鱼未变守江河　不可升腾更望高　 异日峥嵘身变化　许君一跃跳龙门", "鲸鱼未化守江湖。姜太公之受难时也。为大鲸未变之象。凡事进退待时。不可轻举妄动。动则凶。静则吉。君尔也。得忍且忍。得耐且耐身不而托。功名自在者。来日峥嵘蜕身时。一跃可过禹门者", "★★☆☆☆"},
	{"下签", "临风冒雨去还乡　正是其身似燕儿　 衔得坭来欲作垒　到头垒坏复须坭", "冲风冒雨去还归。役役劳心似燕儿。君尔之运逢燕子衔泥筑巢之象耶。空心徒劳。无益者。为先难後甘之运。唯应小心。本签之总结也。千方百计。晨昏鹿鹿不停。谁知此事到底无以可成者。修之。悟之。", "★☆☆☆☆"},
	{"上签", "千年古镜复重圆　女再求夫男再婚　 自此门庭重改换　更添福禄在儿孙", "菱花镜破镜重圆。为破镜重圆之象。凡事成就吉者也。不是上上者。为中中之签。是先凶後吉之签。交易持公平。求财亦在秋冬转旺。如逢如此之中中运也。可积极为善。积德。当有转吉之机", "★★★★★"},
	{"中签", "一锥草地要求泉　努力求之得最难　 无意俄然遇知己　相逢携手上青天", "一锄掘地妥求泉水。此象则表徵君之运图。是凡事谋略之後。劳心方有成就者也。努力向前必有化凶为吉之时。自励奋斗。偶然遇知己。彼时即是君尔。得贵人之刻。在伊人扶持下。必能上青天矣。", "★★★☆☆"},
	{"中签", "投身岩下　鸟居　须是还他大丈夫　 及早营谋谁可得　通行天地此人无", "於岩下饲於菟者。是凡事宜顺则吉之表徵也。得本签之君。应知。为人宜守旧。不可轻举妄动者也。不可贪求非份之外之财。或舍近图远者。皆避免之。予以君知者。使非常清身。岂贫待他时至祥。", "★★★☆☆"},
	{"下签", "奔波阻隔重重险　带水拖坭去度山　 更望他乡求用事　千乡万里未回还", "奔波役役重重险。带水拖泥又渡山之运途也。凡事必须谨慎。准备酌理。探取根源。明其是非者。审一己之进退。方向者。心存恶者得祸。存直者即可为获福矣。祸福者皆由人作之。退身可得进步难为。只宜守田切莫高扳。", "★☆☆☆☆"},
	{"上签", "茂林松柏正兴旺　雨雪风霜总莫为　 异日忽然成大用　功名成就栋梁材", "本签为松怕之岁寒者。任何之树木枯之後。仍挺具秀者。各面均呈祥。当异口成大材老焉。是大器晚成型。惟不可因此满足。必须因此更加培植。事事积德。方可有更好之明日。要之。象徵平地风光风缘有定。丰稔。田稻家获余庆。", "★★★★★"},
	{"上签", "烦君勿作私心事　此意偏宜说问公　 一片明心光皎洁　宛如皎月正天中", "本签者皎月当空之相也。凡事正直则吉之签。虽是前运不佳。前事去之後。渐见顺利者。君尔幸获此签之示者。平素之存心种德之所由成。後得如此之佳境。亦即是心中正直。理顺法宽天无私意莫空虚。", "★★★★★"},
	{"中签", "石藏无价玉和珍　只管他乡外客寻　 宛如持灯更觅火　不如收拾枉劳心", "本签者将灯不见火之相。凡事自就之表徵者。逢此下下之时。宜顶天拜地。始可得无灾。是谋望之不成。修吾身後。积德。布施。後必有回天之机。亦即是机缘若遇何事不成春无限前似真此者也。", "★★★☆☆"},
	{"上签", "欲求胜事可非常　争奈亲姻日暂忙　 到头竟必成中箭　贵人指引贵人乡", "是因祸致福之签。凡事则吉者也。日欲求好事喜非常。暂时安当守份之时。虽是不合之时。亦可有成之时。贵人自有贵人引导之者。因此。君尔之前途是极光明者。有事盼望到底如斯若问此事贵人提携耶。", "★★★★★"},
	{"上签", "否去泰来咫尺间　暂交君子出于山　 若逢虎兔佳音信　立志忙中事即闲", "时临否极泰当来。多年来之恶运。霉道已去。吉星高照之时。事事顺利。一路顺风。毫无阻碍者。将身上抖之擞之。身上之暗埃尽去。尤在卯寅佳信至时。要之。麻换得丝是笑。虽哭要见分明足见为福。", "★★★★★"},
	{"中签", "自小生在富贵家　眼前万物总奢华　 蒙君赐紫金腰带　四海声名定可夸", "君尔也。自小生身富贵之家。於是君汝之生活也。总是奢华之世界者。谋望皆成。惟有贵人之扶持者。必能称意。且不劳而成者。易言之。囚徙得赦。病遇华陀。龙门得过。名显皇都之象。凡事变化则吉也。", "★★★☆☆"},
	{"中签", "宛如仙鹤出凡笼　脱得凡笼路路通　 南北东西无阻隔　任君直上九霄宫", "为白鹤冲天之象也。凡事先忧後吉之大吉签。功名成就。生意鼎盛。婚姻完满。财路亨通之时。宜再多阅圣贤书。修吾身。积吾德。必有喜讯连连之日来也。要之。从心无虑远达亨衢道心自在任意所如者耶。", "★★★☆☆"},
	{"中签", "行人　曰气难吞　忽有灾事勿近前　 巢破林鸟无所宿　可寻深处稳安身", "本签示之於日。触人口气最难吞。如交友中盛气凌人者。令人难以容忍者。亦即是灾厄临时之兆。不可不知也。得罪於人者。如覆巢之祸。爰之。劝君稳便一语存於心。方能有吉。易言之。若得人怨何事可伸。如言不信到底为劳心。巢空之象。因此。凡事守旧则吉者也。", "★★★☆☆"},
	{"中签", "愁眉思虑暂时开　启出云霄喜自来　 宛如粪土中藏玉　良工荐举出尘埃", "如玉在污泥中之象。如获良玉－贵人一举。牵成时。出污泥则。可获吉也。亦即是表明君之今也。咫尺－眼前之灵即拨开得见日者。时运将到者。曰：得处无伪损中有益顺逆吉凶君子得吉之签。", "★★★☆☆"},
	{"中下签", "莫听闲言说是非　晨昏只好念阿弥　 若将狂话为真实　书饼如何止得饥莫听闲言说是非　晨昏只好念阿弥　 若将狂话为真实　书饼如何止得饥", "如心中不定则看轻也枉费心神是己。何以为之。又如人之妄语信之为真。岂非如画饼之充饥。焉得饱食。因时运之末到。时有吉。时有凶。劝**宜晨昏多念阿弥陀佛。莫听闲言及是非。方可安行。凡事虚少实也。", "★★☆☆☆"},
	{"上签", "金乌西坠兔东升　日夜循环至古今　 僧道得知无不利　士农工商各从心", "本签为皎月当夜空。繇东方上升之象。爰之事事亨泰如意者。心中无事。所作皆奏功。又如上弓之一箭。发之即中也。君之今堪称如日月日夜循环恒古今。僧到得之无不利。因此。工商农士无不一一笑颜逐开者。", "★★★★★"},
	{"中签", "急水滩头放船归　风波作波欲何为　 若要安然求稳静　等待浪静过此危", "行舟浪洵之象。亦即是险境者。要之。君尔应知目下宜守旧。愿遵守静则吉。妄为则凶也。杨雄之仕王莽之朝为大夫。何以能胜大任。如在急水滩头放水之险行。待时若问营谋。时至方可为。千万叵轻举妄动。", "★★★☆☆"},
	{"中签", "当春久雨喜开晴　玉兔金乌渐渐明　 旧事消散新事遂　看看一跳遇龙门", "本签者也。久雨初晴之象。为万事可成之兆。惟得此吉签。必须早植因缘。之後当有莫大利益。君尔在交友之中。宜留意者。必须选中之一为贵人。彼将成王公封爵之贵。将有大成之日。汝必能攀附上。易言之。佛神护佑百事无忧想平生事到底初胜者。", "★★★☆☆"},
	{"上签", "阴阳道合总由天　女嫁男婚喜偎然　 但见龙蛇相会合　熊罴入梦乐团圆", "君得之签为阴阳道合之签也。凡事和合而大吉者。君逢此为上吉之运。凡事渐获进步。惟不可欲速成。更不得存有欺人之心。今之形成者。获来不易。佳境之时。宜更修之。省之。积吾善可也。易言之。君之今。营谋皆逐。婚姻孕男。资财积聚更吉田亩之收。", "★★★★★"},
	{"中签", "旱时田里皆枯槁　谢天甘雨落淋淋　 花果草木皆润泽　始知一雨值千金", "本签告之曰。久旱而逢雨之象。简易之。遇难中有贵人救之象也。因之。凡事遇难。千万不能馁志。不能心灰意懒。垂头丧气。君汝之命中。凡逢难事。必有贵人来扶之。如行人之有阻。但贵人代之。具有行人来之效。要之。田禾能倍收。谋望相宜。病逢妙药。行人使归之好运者也。", "★★★☆☆"},
	{"中签", "欲扳仙桂入蟾宫　普开天门不任君　 忽遇一般音信好　人人皆笑岭顶花", "本签为望仙扳桂之象。凡事必能遇赀人之象者。虽属上平。惟宜多作福。求神庇佑之。方有化凶趋吉之时。到头。君汝谋望一般喜讯好。高人。贵人也。日将佳音报之而来。要之。商贾者有利。行藏无危。病可安。讼可理。尽可施为", "★★★☆☆"},
	{"下签", "不成理论不成家　水性痴人似落花　 若问君恩须得力　到头方见事如麻", "本签即是痴人丧德之象。凡事守旧待时。君汝目下即是水泡痴人似落花之命也。事事应顺天理。方平安。眼中无人之时。将何。必有福祸来临。不可不慎。亦即是到头毕竟如麻者。爰之。凡事求神作福。祷告。", "★☆☆☆☆"},
	{"中签", "过了忧危事几重　从今再立永无空　 宽心自有宽心计　得遇高人立大功", "君之签。是宽心自有宽心计。得遇高人－贵人也。方能护圣功。易言之。凡事遇贵人方能吉也。亦即能过了忧危第几重。从今再历永无凶之境。凡事谋略之时必守之。不宜盲目冲之。三思而後行。方不致吃大亏。是到头来讼中有理。病得安癒。出外求外。枯井逢泉者也。", "★★★☆☆"},
	{"中下签", "上下传来事转虚　天边接得一封书　 书中许我功名遂　直到终时亦是虚", "是接目虚望之象。宜守旧待时者。不可听信世人之言。宜自吾有主见。以智止谣。何必听人之者。宜向神求之。神灵加护之时。必有转机。因直待终时亦是无者。因此。守之。规谋之。待来日之计用之。易言之。求闲不闻。目下心烦。欲求名利。徒尔虚投者。", "★★☆☆☆"},
	{"中签", "一谋一用一番书　虑后思前不敢为　 时到贵人相助力　如山墙立可安居", "本签者。墙有基址之家。凡事接引贵人乡者。君之今也。一谋一事一番机之时。举棋不定之刻。惟君正逢贵人助也。有银墙铁壁所安靠之人。虽有贵人之签。必须慎交。方有向善之效。否则受伊人愚弄。反得败名。", "★★★☆☆"},
	{"中签", "东边月上正蝉娟　顷刻云遮亦暗存　 或有圆时还有缺　更言非者亦闲言", "本签为月被云遮之象。亦即是凡事。暂时且守旧。待时老。君汝之早年也。事事不遇之时。唯多年辛勤。终能入佳境。事事如意者。好景已迫眉睫。愿君多行善。亦即是言积德。以迓天庥者。君之目前即是浮云遮月不得疑惑。得待云开自见明月时。", "★★★☆☆"},
	{"中签", "宝剑出匣耀光明　在匣全然不惹尘　 今得贵人携出现　有威有势众人钦", "本签示之曰。是宝剑出匣之象。凡事有高人指出时。必有成者。尽可防身更无疑者。时运已济。安闲守分。至卯年月。大有发展。锋芒毕露者。士子科第。仕官之人。得擢升。另言之。宝剑出匣光辉万里贵人指出。无不赞美者也。", "★★★☆☆"},
	{"中签", "劝君切莫向他求　似鹤飞来暗箭投　 若去采薪蛇在草　恐遭毒口也忧愁", "本签示之曰。若去采薪蛇伏草。恐遭毒手也堪虞之命途耶。是安身得己之象。凡事暂守旧待时之者。谋事不相宜。一事无成者。田亩。六畜之不利於时。唯山坎是大吉者。易言之。闭口存舌。闲事莫理不可生心恐伤于己。", "★★★☆☆"},
	{"中签", "清闲无忧静处侩　饱后吃茶时坐卧　 汝下身心不用忙　必定不招冤与祸", "本签曰。清闲无事静处坐。饥时吃饭困时卧。可知君尔者当守己安静之时。凡事宜守旧。不宜在此时轻举妄动。动则凶。静则吉之刻。放下身心不用忙。唯有如此。方可除去祸与殃。易言之。守己安静即是待他时之至。必定周全。", "★★★☆☆"},
	{"中签", "归程杳杳定无疑　石中藏玉有谁知　 一朝良匠分明剖　始觉安然碧玉期", "本签示於曰。君今之命运也。如石中剖玉之象。八百事啻要费力即可成者。易言之。汝是石中藏玉虽知。孜孜不倦中取玉之勤劳人。人生旅途中。常有惊险之象出现。易言之。玉在石中。匠手可知。直待剖出真可施。", "★★★☆☆"},
	{"中签", "内藏无价宝和珍　得玉何须外界寻　 不如等待高人识　宽心犹且更宽心", "又是珍玉内藏之象。是凡事忍耐得吉者也。君汝之今也。谋略不宜之时。乍看似机缘。行之反覆为之。无一事可成。石中既有玉藏。何必向外去寻。亦即是君守於今。自有展谋之时。不宜动。动不如一静。易言之。珍玉内藏不时求。不见待若遇贵人。事则得吉。", "★★★☆☆"},
	{"中上签", "行藏出入礼义恭　言必忠良信必从　 心不了然且静澈　光明红日正当中", "本签也。红日当空之象。凡事自来有成。君之今也。出入行藏礼义恭。言必忠良听必聪。与友朋。长辈之交。必须礼恭。天下之事能透彻。君之运也。光明则如日正当空时。易言之。空中无事秋水澄清别无阻碍。自然有成者。", "★★★★☆"},
	{"中签", "衣冠重整旧家风　道是无穹却有功　 扫却当途荆棘刺　三人约议再和同", "此签是扫却当途荆棘碍。三人共议事相同者。可知重整之象。凡事改变即大吉。功名。交易均可得利。求财。时运。六畜亦均有利可图。是谋略成功。年运亨通之时。一旦称心。万事通之刻。君汝之今为不须忧虑。自有期间。前程事更换可宜。", "★★★☆☆"},
	{"中签", "眼前病讼不须忧　宝地资财尽可求　 恰似猿猴金锁脱　自归山洞去来悠", "本签曰。目前病讼不须忧。实地资财尽可求。是上上之签。惟有积德。布施之举。必可更进展之机。如忽尔遇不如意之时。因君汝目下是系猿脱锁之象。凡是通泰。因此。再加修心向善。必有神佑。易言之。且自宽舒待他时至路达通衢也。", "★★★☆☆"},
	{"中签", "欲待身安动泰时　风中灯烛不相宜　 不如收拾深堂坐　庶免光摇静处明", "本签也。风前灯烛之签也。不相宜者。惟凡事小心。谨慎则吉也。君必须收拾深堂坐。亦即是得静为宜吉。如动则凶至。只好暂时忍耐之。时到之时。必有吉祥之象。随君而来。易言之。静处安身命待时泰。动心惹祸。静守救危耶。", "★★★☆☆"},
	{"下签", "月照天宅静处期　忽遭云雾又昏迷　宅有作书 宽心祈信云霞散　此时更改好施为", "本签为浮云遮月之象。目前事事无须如意之时亦即是劝君叵动。俟时运之来至。动之方吉利。唯有汝宽心守待。耐心待至拨云见皎洁月娘时。汝即家居无忧。人口阴灾作福。保佑之。不致有破财之时。守之。不宜不遵行。", "★☆☆☆☆"},
	{"下签", "天边消息实难思　切莫多心望强求　 若把石头磨作镜　曾知枉费己功夫", "本签告之於曰。若把石头磨成镜。精神枉费一时休之安静守旧之象也。一切事宜皆在低潮中。宜小心。小心。如六畜之损。田亩之亏。宜拾旧图新。适合时潮。方能振兴起色。六甲生女亦不必气馁。宜积德。修身为先。必有赖之。易言之。千般用计届时皆空心守旧。不必强求者。", "★☆☆☆☆"},
	{"中签", "红轮西坠兔东升　阴长阳消百事亨　 是若女人宜望用　增添财禄福其心", "本签是阴长阳消之家。凡事先难後吉者。不管是交易。求财。时运。均在开始时。均为不利。但是因一己之奋斗。苦心造诣。终有出头之日。所幸田亩大收。六畜兴旺。皆是祈福所赐。疾病。皆有险。宜小心。易言之。阴利女人。不宜男子。若问求望。无忧从喜。", "★★★☆☆"},
	{"中签", "无限好言君记取　却为认贼将作子　 莫贪眼下有些甜　更虑他年前样看", "本签示於曰。认贼为子之象。不宜苟且者。神戒之曰。莫贪眼下有些甜头。趋之。後果堪虞。到头来还是受苦者。功名。交易。尚不理想。求财皆在待时之命运。为认贼作子之时。易言之。只道一著君子莫错宰把身心不致耽搁。", "★★★☆☆"},
	{"上签", "君皇圣后终为恩　复待祈禳无损增　 一切有情皆受用　人间天上得期亨", "本签示之曰。天垂甘露之泉。凡事大吉利者。亦即是先难後易者所得。功名成。交易就。婚姻虽平庸。但是难得之缘也。时运至冬季即至。六畜。田亩皆旺之时。宜勤俭。千万不得浪透。陷已於绝境者。易言之。天降甘露。君子莫忘求谋成就。和合吉昌之签也。", "★★★★★"},
	{"上签", "天地变通万物全　自营自养自安然　 生罗万象皆精彩　事事如心谢圣贤", "本签为天地交泰之象。是事事和谐得称人者。季冬有喜。交春之时。人事遂意者。必是喜事连连之人。万象新之时。自形自色自怡神。事事吉祥之际遇。相机而动者。易言之。本签者天生万物谋望皆新福德积聚瑞气添增。可喜之签也。", "★★★★★"},
	{"中签", "棋逢敌手著相宜　黑白盘中未决时　 皆因一著知胜败　须教自有好推宜", "本签为棋逢敌手之象也。凡事先吉。凡未小心。节俭则有转恶之嫌。宜小心为之。棋逢敌手之时。必藏有机。决定胜负之时莫迟疑。认为可行则毫不犹豫之下即可。尤应和者。善有善报。恶有恶报。示人早知觉悟多作善。方能有善报者。", "★★★☆☆"},
	{"上签", "温柔自古胜刚强　积善之门大吉昌　 若是有人占此卦　宛如正渴遇瑶浆", "本签为积福门庭之象。凡事谋则吉者也。灵签曰。温柔自是胜强刚。积善于门大吉昌。为使己之事务。求财。时运吉昌者。必须积善。修德。布施。方能亨之。久而弥坚。易言之。天地有感应验非常佛神保持得福寿长之签。", "★★★★★"},
	{"中签", "勤君耐守旧生涯　把定心肠勿起歹　 直待有人轻著力　枯枝老树再生花", "本签为枯木生花之家。即是万物逢春复苏之象。君尔多年辛劳得报於斯时。惟早植因缘。必有喜事连连。诗日：劝君耐守旧生涯。爰之。君之今宜静。不宜动。动则凶。静则吉。亦方能枯木再开花。向使逢遇贵人。可攀之。伊者後日之诸侯。易言之。决心守旧时至成就行多多逆。安静无忧。", "★★★☆☆"},
	{"上签", "锦上添花色愈鲜　运来禄马喜双全　 时人莫恨功名晚　一举登科四海传", "本签者。福禄双全之象者。凡事兴隆大吉之签。曰锦上添花色更鲜。运来之时也喜双全。八十二对大魁。不是晚也。奉献社会人群。积吾德。荫子孙。何乐不为。为天数之所赐。宜再积德。方有同点灯之故。易言之。儿有双亲。守时待庆遂平生志。都来自命。", "★★★★★"},
	{"中签", "昆鸟秋来化作鹏　好游快乐喜飞腾　 翱翔万里云霄去　余外诸禽终不能", "本签为昆鸟乌化鹏之吉象也。凡事皆能兴隆大吉。功名成之。利得之。婚合之。六畜旺之。六甲全之。官事。等等。无一不顺利也。直冲云霄之外。无可与伦比者。惟逢此佳境。勿忘今之所由成。积德。布施之再行者。可维护君尔之谋望无疑。易言之。今之君也。桂花时节财禄成此。", "★★★☆☆"},
	{"中签", "天寒地冻水成冰　何须贪吝取功名　 只好守己静处坐　待叶兴盛自然明", "王祥求鲤说的是孝子王祥很孝顺其母亲。他母亲常年多病，有一年冬天，天很冷，河都结冰了，他母亲却说要吃鲤鱼。所以，他就费尽心机想 尽办法去鞤他母亲找鲤鱼。最终，他的孝心得到回报，找到了鲤鱼。这签文说的是要你不要烦躁，只要你努力，自然有回报", "★★★☆☆"},
	{"中上签", "夏日炎天日最长　人人愁热闷非常　 天地也解知人意　薰风拂拂自然凉", "本签之诗也。炎天生凉之家。凡事所谋稳当者。虽是中平之签。人生之乐在於此。凡事知足之时即大安。谋事不宜因小嫌弃。改大则败者。一石拾之嫌小。舍之。再拾之。无一而足者。到头无石可捡。易言之。进用莫疑。最佳期日至。凡成谋望。不须忧虑。", "★★★★☆"},
	{"下签", "出入求谋事宜迟　急恐忧愁惹是非　 如鸟飞入罗网内　脱困能有几多时", "本签者。禽遭罗网之象。凡百事守旧可获安者。诗曰。经商出入事迟疑。也因此惹闲愁。不必要之愁争。听了是是非非。谣言四播。逢遇如此罗网苦境中。必须多修幅。积德方能脱离险境者耶。易言之，君之今也，禽遭罗网有理难分。随缘守旧遇贵乃成之命耶。", "★☆☆☆☆"},
	{"下签", "勒马持鞭直过来　半有忧危半有灾　 恰似遭火焚烧屋　天降时雨荡成灰", "本签示之於者凶危有之象。凡事凶後吉耶。等闲骑马著马鞭来。半有忧危半有财。似火方烧头上屋。正受灾殃之刻。一场大雨来了之後。方可将灾厄洗清而去。目下虽事难成。劳心劳力之後。必有转安之时。易言之。君汝也。知如不知。不管是非临枷锁恩赦放归。", "★☆☆☆☆"},
	{"下签", "佛神灵变与君知　痴人说事转昏迷　 老人求得灵签去　不如守旧待时来", "本签耶。无定之象。外虚少实者也。第一百首。是盈数。为全数之末。亦即言。它是前数之终。後数之始。易言之。黑暗将去。黎明到来之徵。表面上是没落之相。其实是通亨衢之意。唯集福之本。宜小心集之。及百析之未然营谋用事费力流连", "★☆☆☆☆"},
}

func LuckyDaily(qqId string) string {
	msg := ""
	r := rand.New(rand.NewSource(time.Now().UnixNano()))
	num := r.Int() % 53
	ans := dao.DBManager.MarkDayilyLuck(context.Background(), qqId, num)
	if ans != -1 {
		llog.Error("今日运势已经测过了：")
		num = ans
		msg = "\n今天你已经测过今日运势了，请明天再来找蓝妹吧~"
	}
	msg += fmt.Sprintf("\n%s  %s\n\n%s\n\n解签：%s", sign[num][0], sign[num][3], sign[num][1], sign[num][2])
	return msg
}
